In [1]:
import numpy as np
import pandas as pd

# 一 关系链接

# 值的连接 merge

In [4]:
df1 = pd.DataFrame({'Name':['San Zhang','Si Li'], 'Age':[20,30]})
df1

        Name  Age
0  San Zhang   20
1      Si Li   30

In [5]:
df2 = pd.DataFrame({'Name':['Si Li','Wu Wang'], 'Gender':['F','M']})
df2

      Name Gender
0    Si Li      F
1  Wu Wang      M

In [6]:
df1.merge(df2, on='Name', how='left')

        Name  Age Gender
0  San Zhang   20    NaN
1      Si Li   30      F

In [7]:
df1 = pd.DataFrame({'df1_name':['San Zhang','Si Li'], 'Age':[20,30]})
df1

    df1_name  Age
0  San Zhang   20
1      Si Li   30

In [8]:
df2 = pd.DataFrame({'df2_name':['Si Li','Wu Wang'], 'Gender':['F','M']})
df2

  df2_name Gender
0    Si Li      F
1  Wu Wang      M

In [9]:
df1.merge(df2, left_on="df1_name", right_on="df2_name", how="right")

  df1_name   Age df2_name Gender
0    Si Li  30.0    Si Li      F
1      NaN   NaN  Wu Wang      M

## how{‘left’, ‘right’, ‘outer’, ‘inner’, ‘cross’}, default ‘inner’

In [10]:
df1 = pd.DataFrame({"df1_name":["Amy","Tony","Larry","David","Tobi"],"Height":[163,183,173,182,191]})
df1

  df1_name  Height
0      Amy     163
1     Tony     183
2    Larry     173
3    David     182
4     Tobi     191

In [11]:
df2 = pd.DataFrame({"df2_name":["Tobi","David","Ken","Vova","Steve","Amy","Leana"],"Weight":[75,82,67,62,73,52,55]})
df2

  df2_name  Weight
0     Tobi      75
1    David      82
2      Ken      67
3     Vova      62
4    Steve      73
5      Amy      52
6    Leana      55

### merge will create duplicate columns when left_on right_on different columns names, use drop("columnname", axis=1)

In [14]:
df1.merge(df2, left_on="df1_name",right_on="df2_name",how="inner").drop("df2_name", axis=1)

  df1_name  Height  Weight
0      Amy     163      52
1    David     182      82
2     Tobi     191      75

In [15]:
df1.merge(df2, left_on="df1_name",right_on="df2_name",how="outer").drop("df2_name", axis=1)

  df1_name  Height  Weight
0      Amy   163.0    52.0
1     Tony   183.0     NaN
2    Larry   173.0     NaN
3    David   182.0    82.0
4     Tobi   191.0    75.0
5      NaN     NaN    67.0
6      NaN     NaN    62.0
7      NaN     NaN    73.0
8      NaN     NaN    55.0

In [16]:
df1.merge(df2, left_on="df1_name",right_on="df2_name",how="left").drop("df2_name", axis=1)

  df1_name  Height  Weight
0      Amy     163    52.0
1     Tony     183     NaN
2    Larry     173     NaN
3    David     182    82.0
4     Tobi     191    75.0

In [18]:
df1.merge(df2, left_on="df1_name",right_on="df2_name",how="right").drop("df1_name", axis=1)

   Height df2_name  Weight
0   191.0     Tobi      75
1   182.0    David      82
2     NaN      Ken      67
3     NaN     Vova      62
4     NaN    Steve      73
5   163.0      Amy      52
6     NaN    Leana      55

## how to reorder columns for table above?

#### use reindex
#### use rename (columns={"old1":new1, old2:new2, old3:new3 })

In [27]:
df_reorder = df1.merge(df2, left_on="df1_name",right_on="df2_name",how="right").drop("df1_name", axis=1)
df_reorder.reindex(["df2_name","Height","Weight"],axis=1).rename(columns={"df2_name":"Name"})
df_toSave = df_reorder.reindex(["df2_name","Height","Weight"],axis=1).rename(columns={"df2_name":"Name"})
df_toSave

    Name  Height  Weight
0   Tobi   191.0      75
1  David   182.0      82
2    Ken     NaN      67
3   Vova     NaN      62
4  Steve     NaN      73
5    Amy   163.0      52
6  Leana     NaN      55

In [28]:
df_toSave.to_csv("./data/join_right_reindex_renamed.csv", index=False)

### 如果合并的量表有重名列，但数据不一样

In [29]:
df1 = pd.DataFrame({"Name":["Toni","Vova"],"Country":["Finland","Russia"]})
df1

   Name  Country
0  Toni  Finland
1  Vova   Russia

In [31]:
df2 = pd.DataFrame({"Name":["Vova","Toni"],"Country":["Spain","Belgium"]})
df2

   Name  Country
0  Vova    Spain
1  Toni  Belgium

In [34]:
df1.merge(df2, on="Name", suffixes=["_Departure","_Destination"])

   Name Country_Departure Country_Destination
0  Toni           Finland             Belgium
1  Vova            Russia               Spain

# 索引链接 Join

In [35]:
df1 = pd.DataFrame({'Age':[20,30]}, index=pd.Series(['San Zhang','Si Li'],name='Name'))
df1

           Age
Name
San Zhang   20
Si Li       30

In [36]:
df2 = pd.DataFrame({'Gender':['F','M']}, index=pd.Series(['Si Li','Wu Wang'],name='Name'))
df2

        Gender
Name
Si Li        F
Wu Wang      M

In [37]:
df1.join(df2, how='left')

           Age Gender
Name
San Zhang   20    NaN
Si Li       30      F

### 索引的join 和 值的merge 很类似，唯一区别是，merge on 普通的column， join on index

In [38]:
df1 = pd.DataFrame({'Grade':[70]}, index=pd.Series(['San Zhang'], name='Name'))
df1

           Grade
Name
San Zhang     70

In [39]:
df2 = pd.DataFrame({'Grade':[80]}, index=pd.Series(['San Zhang'], name='Name'))
df2

           Grade
Name
San Zhang     80

In [40]:
df1.join(df2, how='left', lsuffix='_Chinese', rsuffix='_Math')

           Grade_Chinese  Grade_Math
Name
San Zhang             70          80

In [47]:
df1 = pd.DataFrame(data=[173,175],index=pd.Series(["Chao","Vova"], name="name_index"), columns=["Value"] )
df1

            Value
name_index
Chao          173
Vova          175

In [48]:
df2 = pd.DataFrame(data=[69,60],index=pd.Series(["Chao","Vova"], name="index_name"), columns=["Value"])
df2

            Value
index_name
Chao           69
Vova           60

In [51]:
df1.join(df2, how="inner",lsuffix="_Height", rsuffix="_Weight")

            Value_Height  Value_Weight
name_index
Chao                 173            69
Vova                 175            60

# 二 方向链接

## 纵向 axis =0 default

In [52]:
df1 = pd.DataFrame({'Name':['San Zhang','Si Li'], 'Age':[20,30]})
df1

        Name  Age
0  San Zhang   20
1      Si Li   30

In [53]:
df2 = pd.DataFrame({'Name':['Wu Wang'], 'Age':[40]})
df2

      Name  Age
0  Wu Wang   40

In [54]:
pd.concat([df1, df2])

        Name  Age
0  San Zhang   20
1      Si Li   30
0    Wu Wang   40

In [55]:
pd.concat([df1, df2], axis=1)

        Name  Age     Name   Age
0  San Zhang   20  Wu Wang  40.0
1      Si Li   30      NaN   NaN

In [56]:
pd.concat([df1, df2], axis=0)

        Name  Age
0  San Zhang   20
1      Si Li   30
0    Wu Wang   40

## 横向 axis=1

In [57]:
df2 = pd.DataFrame({'Grade':[80, 90]})
df2

   Grade
0     80
1     90

In [58]:
df3 = pd.DataFrame({'Gender':['M', 'F']})
df3

  Gender
0      M
1      F

In [59]:
pd.concat([df1, df2, df3], axis=1)

        Name  Age  Grade Gender
0  San Zhang   20     80      M
1      Si Li   30     90      F

## 默认他会outer 来广播填满

In [61]:
pd.concat([df1, df2, df3], axis=0)

        Name   Age  Grade Gender
0  San Zhang  20.0    NaN    NaN
1      Si Li  30.0    NaN    NaN
0        NaN   NaN   80.0    NaN
1        NaN   NaN   90.0    NaN
0        NaN   NaN    NaN      M
1        NaN   NaN    NaN      F

In [64]:
df1 = pd.DataFrame({"Name":["Chao","Vova","Apurva"],"Age":[26,29,27]})
df1

     Name  Age
0    Chao   26
1    Vova   29
2  Apurva   27

In [65]:
df2 = pd.DataFrame({"Country":["China","Russia","India","Finland","Germany","Italy"],"Vegan":[False,False,True,True,False,False]})
df2

   Country  Vegan
0    China  False
1   Russia  False
2    India   True
3  Finland   True
4  Germany  False
5    Italy  False

In [67]:
pd.concat([df1,df2], axis = 1)

     Name   Age  Country  Vegan
0    Chao  26.0    China  False
1    Vova  29.0   Russia  False
2  Apurva  27.0    India   True
3     NaN   NaN  Finland   True
4     NaN   NaN  Germany  False
5     NaN   NaN    Italy  False

In [69]:
pd.concat([df1,df2], axis = 1, join="inner")

     Name  Age Country  Vegan
0    Chao   26   China  False
1    Vova   29  Russia  False
2  Apurva   27   India   True

### keys 帮忙查看数据 concat前来自哪个表

In [71]:
pd.concat([df1,df2], axis = 1, join="inner", keys=["第一个表","第二个表"])

     第一个表        第二个表
     Name Age Country  Vegan
0    Chao  26   China  False
1    Vova  29  Russia  False
2  Apurva  27   India   True

In [73]:
pd.concat([df1,df2], axis = 0, join="outer", keys=["第一个表","第二个表"])

          Name   Age  Country  Vegan
第一个表 0    Chao  26.0      NaN    NaN
     1    Vova  29.0      NaN    NaN
     2  Apurva  27.0      NaN    NaN
第二个表 0     NaN   NaN    China  False
     1     NaN   NaN   Russia  False
     2     NaN   NaN    India   True
     3     NaN   NaN  Finland   True
     4     NaN   NaN  Germany  False
     5     NaN   NaN    Italy  False

# 合并 series 和 dataframe

## append 即将被弃用

In [81]:
ser1 = pd.Series(["coffee","green tea","mashala chai"], index=[0,1,2])
ser1

0          coffee
1       green tea
2    mashala chai
dtype: object

In [86]:
ser2 = pd.Series(["Toby",32],index=["Name","Age"])

In [88]:
df1.append(ser2,ignore_index=True)

C:\Users\Chao\AppData\Local\Temp\ipykernel_14764\4070422447.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(ser2,ignore_index=True)

     Name  Age
0    Chao   26
1    Vova   29
2  Apurva   27
3    Toby   32

In [83]:
pd.concat([df1,ser1],axis=1,ignore_index=True)

        0   1             2
0    Chao  26        coffee
1    Vova  29     green tea
2  Apurva  27  mashala chai

## assign

In [90]:
df1.assign(Drink=ser1)

     Name  Age         Drink
0    Chao   26        coffee
1    Vova   29     green tea
2  Apurva   27  mashala chai

In [93]:
df1["Drink"]= ser1
df1

     Name  Age         Drink
0    Chao   26        coffee
1    Vova   29     green tea
2  Apurva   27  mashala chai

#### df["new col"] =  会直接新增一列

In [94]:
df1[["col_1","col_2","col_3"]]=[["A","B","C"],["a","b","c"],["你","好","啊"]]

In [95]:
df1

     Name  Age         Drink col_1 col_2 col_3
0    Chao   26        coffee     A     B     C
1    Vova   29     green tea     a     b     c
2  Apurva   27  mashala chai     你     好     啊

In [96]:
df1[["col_1","col_2","col_3"]]=[["第","第","第"],["一","二","三"],["列","列","列"]] #这里事按row 方向的， 
df1

     Name  Age         Drink col_1 col_2 col_3
0    Chao   26        coffee     第     第     第
1    Vova   29     green tea     一     二     三
2  Apurva   27  mashala chai     列     列     列